<?php 

// +----------------------------------------------------------------------
// | PHPCrawler [ 一个关于PHP爬虫的框架 ]
// +----------------------------------------------------------------------
// | Time: 2017年11月14日11:24:37
// +----------------------------------------------------------------------
// | Author: 放水的星星 https://github.com/fsdstar
// +----------------------------------------------------------------------

//----------------------------------
// PHPCrawler栈接口文件
// 用于用户自定义其他类型的接口文件（内置内存和redis）
// 需要实现的方法
// 初始化栈
// 压栈
// 弹栈
// 当前栈个数
// 销毁栈
//----------------------------------


interface stackInterface
{
	public function __construct();
	public function inStack($url);
	public function outStack();
	public function isEmpty();
	public function __destruct();
}